IDEA StatiCa Open Model
LoadingType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of loading
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum LoadingType
Public Enumeration LoadingType
public enum class LoadingType
Members
Member name | Value | Description
LoadCase | 0 |  Load case
Combination | 1 |  Combination
ResultClass | 2 |  Result Class
See Also
Reference
IdeaRS.OpenModel.Result Namespace